Revit 2027 API
UV.DistanceTo Method
Returns the distance from this 2-D point to the specified 2-D point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double DistanceTo(
	UV source
)
Public Function DistanceTo (
	source As UV
) As Double
public:
double DistanceTo(
	UV^ source
)
member DistanceTo :
        source : UV -> float
Parameters
source UV
The specified point.
Return Value
Double
The real number equal to the distance between the two points.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when source is null.
Remarks
 The distance between the two points is equal to the length of the vector that joins the two points.
See Also
Reference
UV Class
Autodesk.Revit.DB Namespace